insert into 學生
values('S009','東方不敗','男','02-89878545','1990-1/1')

insert into 學生
values('S010','令狐沖','男',null,null)

insert into 學生(姓名,性別,學號)
values('岳不群','男','S011')

insert into 學生
values('S009','任我行','男','02-5555555','1997-1/1')

insert into 學生(性別,學號)
values('男','S012')

select * from 學生

---------------------------------------------------------------------

--一次多筆資料
insert into 學生
values('S012','任我行1','男','02-5555555','1997-1/1'),
('S013','任我行2','男','02-5555555','1997-1/1'),
('S014','任我行3','男','02-5555555','1997-1/1'),
('S015','任我行4','男','02-5555555','1997-1/1'),
('S016','任我行5','男','02-5555555','1997-1/1')

------------------------------------------------------
--課程備份資料表必須是不存在的
select * into 課程備份
from 課程

--課程備份資料表必須是存在的
insert into 課程備份
select * from 課程
where 學分>=3